_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ЗаказНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ЗаказНаПеревозку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ДанныеДоставки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыЗаказаНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ИсполнителиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправленияЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КДоставке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ДанныеДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ДанныеДоставки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_ЗаказНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныАдресов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОжидаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ИсполнителиДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_СтатусыЗаказаНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_СтатусыЗаказаНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ИсполнителиДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ИсполнителиДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтороннийПеревозчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ЗаказНаПеревозку/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапросаВТ_ДанныеДоставки(),			"ВТ_ДанныеДоставки");
	ТекстыЗапроса.Добавить(ТекстЗапросаТаблицаДоставка(),			"ТаблицаДоставка");
	
	Запрос.Текст = "";
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		Запрос.Текст = Запрос.Текст + ТекстЗапроса.Значение;
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	// Выполним запрос
	
	Если Не Запрос.Текст ="" Тогда
		Результат = Запрос.ВыполнитьПакет();
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		ИмяТаблицы = ТекстЗапроса.Представление;
		Если Не ПустаяСтрока(ИмяТаблицы) Тогда
			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			ДополнительныеСвойства.ТаблицыДляДвижений.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УСОERP_ЗаказНаПеревозку.Ссылка,
	|	УСОERP_ЗаказНаПеревозку.Дата КАК Период,
	|	УСОERP_ЗаказНаПеревозку.Организация,
	|	УСОERP_ЗаказНаПеревозку.СрокДоставки,
	|	УСОERP_ЗаказНаПеревозку.Партнер,
	|	УСОERP_ЗаказНаПеревозку.Контрагент,
	|	УСОERP_ЗаказНаПеревозку.АдресОтправления,
	|	УСОERP_ЗаказНаПеревозку.АдресДоставки,
	|	УСОERP_ЗаказНаПеревозку.Склад,
	|	УСОERP_ЗаказНаПеревозку.Договор,
	|	УСОERP_ЗаказНаПеревозку.ВидДоставки,
	|	УСОERP_ЗаказНаПеревозку.ВидОперации
	|ИЗ
	|	Документ.УСОERP_ЗаказНаПеревозку КАК УСОERP_ЗаказНаПеревозку
	|ГДЕ
	|	УСОERP_ЗаказНаПеревозку.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	//
	Запрос.УстановитьПараметр("Ссылка",	Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("КонецПериода",	Новый Граница(КонецДня(Реквизиты.Ссылка.Дата), ВидГраницы.Включая));
	
КонецПроцедуры

Функция ТекстЗапросаВТ_ДанныеДоставки()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка КАК Регистратор,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.Дата КАК Период,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.Организация,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.ЗаказПоставщику,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Номенклатура,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Характеристика,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Количество,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.АдресОтправления,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.АдресДоставки,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.СрокДоставки КАК ОжидаемаяДатаДоставки,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.Статус,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка КАК ЗаказНаДоставку,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.ВидОперации КАК Исполнитель,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.ВидДоставки,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.Партнер,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка.Контрагент,
	|	УСОERP_ЗаказНаПеревозкуКДоставке.ДатаПоступления
	|ПОМЕСТИТЬ ВТ_ДанныеТоваровКДоставке
	|ИЗ
	|	Документ.УСОERP_ЗаказНаПеревозку.КДоставке КАК УСОERP_ЗаказНаПеревозкуКДоставке
	|ГДЕ
	|	УСОERP_ЗаказНаПеревозкуКДоставке.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДоставка()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВТ_ДанныеТоваровКДоставке.Регистратор,
	|	ВТ_ДанныеТоваровКДоставке.Период,
	|	ВТ_ДанныеТоваровКДоставке.Организация,
	|	ВТ_ДанныеТоваровКДоставке.ЗаказПоставщику,
	|	ВТ_ДанныеТоваровКДоставке.Номенклатура,
	|	ВТ_ДанныеТоваровКДоставке.Характеристика,
	|	ЕСТЬNULL(ВТ_ДанныеТоваровКДоставке.Количество, 0) КАК Количество,
	|	УСОERP_ДанныеДоставкиОстатки.АдресОтправления,
	|	УСОERP_ДанныеДоставкиОстатки.АдресДоставки,
	|	УСОERP_ДанныеДоставкиОстатки.ОжидаемаяДатаДоставки КАК ОжидаемаяДатаДоставки,
	|	УСОERP_ДанныеДоставкиОстатки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	УСОERP_ДанныеДоставкиОстатки.Исполнитель КАК Исполнитель,
	|	УСОERP_ДанныеДоставкиОстатки.ВидДоставки КАК ВидДоставки,
	|	УСОERP_ДанныеДоставкиОстатки.Партнер КАК Партнер,
	|	УСОERP_ДанныеДоставкиОстатки.Контрагент КАК Контрагент,
	|	УСОERP_ДанныеДоставкиОстатки.ДатаПоступления КАК ДатаПоступления
	|ИЗ
	|	ВТ_ДанныеТоваровКДоставке КАК ВТ_ДанныеТоваровКДоставке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УСОERP_ДанныеДоставки.Остатки(
	|				&КонецПериода,
	|				(ЗаказПоставщику, Номенклатура, Характеристика, Организация) В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеТоваровКДоставке.ЗаказПоставщику,
	|						ВТ_ДанныеТоваровКДоставке.Номенклатура,
	|						ВТ_ДанныеТоваровКДоставке.Характеристика,
	|						ВТ_ДанныеТоваровКДоставке.Организация
	|					ИЗ
	|						ВТ_ДанныеТоваровКДоставке КАК ВТ_ДанныеТоваровКДоставке)) КАК УСОERP_ДанныеДоставкиОстатки
	|		ПО ВТ_ДанныеТоваровКДоставке.ЗаказПоставщику = УСОERP_ДанныеДоставкиОстатки.ЗаказПоставщику
	|			И ВТ_ДанныеТоваровКДоставке.Организация = УСОERP_ДанныеДоставкиОстатки.Организация
	|			И ВТ_ДанныеТоваровКДоставке.Номенклатура = УСОERP_ДанныеДоставкиОстатки.Номенклатура
	|			И ВТ_ДанныеТоваровКДоставке.Характеристика = УСОERP_ДанныеДоставкиОстатки.Характеристика
	|			И (ВТ_ДанныеТоваровКДоставке.АдресОтправления = УСОERP_ДанныеДоставкиОстатки.АдресОтправления
	|					И УСОERP_ДанныеДоставкиОстатки.ЗаказНаДоставку = ЗНАЧЕНИЕ(Документ.УСОERP_ЗаказНаПеревозку.ПустаяСсылка)
	|				ИЛИ УСОERP_ДанныеДоставкиОстатки.ЗаказНаДоставку <> ЗНАЧЕНИЕ(Документ.УСОERP_ЗаказНаПеревозку.ПустаяСсылка)
	|					И ВТ_ДанныеТоваровКДоставке.АдресОтправления = УСОERP_ДанныеДоставкиОстатки.АдресДоставки)
	|			И ВТ_ДанныеТоваровКДоставке.ДатаПоступления = УСОERP_ДанныеДоставкиОстатки.ДатаПоступления
	|ГДЕ
	|	НЕ ВТ_ДанныеТоваровКДоставке.Статус В (ЗНАЧЕНИЕ(Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Отменен))
	|	И ЕСТЬNULL(УСОERP_ДанныеДоставкиОстатки.КоличествоОстаток, 0) <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеТоваровКДоставке.Регистратор,
	|	УСОERP_ДанныеДоставкиОстатки.АдресДоставки,
	|	ВТ_ДанныеТоваровКДоставке.ЗаказНаДоставку,
	|	ВТ_ДанныеТоваровКДоставке.Организация,
	|	УСОERP_ДанныеДоставкиОстатки.ОжидаемаяДатаДоставки,
	|	ВТ_ДанныеТоваровКДоставке.ЗаказПоставщику,
	|	ВТ_ДанныеТоваровКДоставке.Номенклатура,
	|	УСОERP_ДанныеДоставкиОстатки.АдресОтправления,
	|	ВТ_ДанныеТоваровКДоставке.Период,
	|	ВТ_ДанныеТоваровКДоставке.Характеристика,
	|	УСОERP_ДанныеДоставкиОстатки.ЗаказНаДоставку,
	|	УСОERP_ДанныеДоставкиОстатки.Исполнитель,
	|	УСОERP_ДанныеДоставкиОстатки.ВидДоставки,
	|	УСОERP_ДанныеДоставкиОстатки.Партнер,
	|	УСОERP_ДанныеДоставкиОстатки.Контрагент,
	|	УСОERP_ДанныеДоставкиОстатки.ДатаПоступления,
	|	ЕСТЬNULL(ВТ_ДанныеТоваровКДоставке.Количество, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеТоваровКДоставке.Регистратор,
	|	ВТ_ДанныеТоваровКДоставке.Период,
	|	ВТ_ДанныеТоваровКДоставке.Организация,
	|	ВТ_ДанныеТоваровКДоставке.ЗаказПоставщику,
	|	ВТ_ДанныеТоваровКДоставке.Номенклатура,
	|	ВТ_ДанныеТоваровКДоставке.Характеристика,
	|	ВТ_ДанныеТоваровКДоставке.Количество,
	|	ВТ_ДанныеТоваровКДоставке.АдресОтправления,
	|	ВТ_ДанныеТоваровКДоставке.АдресДоставки,
	|	ВТ_ДанныеТоваровКДоставке.ОжидаемаяДатаДоставки,
	|	ВТ_ДанныеТоваровКДоставке.ЗаказНаДоставку,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВТ_ДанныеТоваровКДоставке.Исполнитель,
	|	ВТ_ДанныеТоваровКДоставке.ВидДоставки,
	|	ВТ_ДанныеТоваровКДоставке.Партнер,
	|	ВТ_ДанныеТоваровКДоставке.Контрагент,
	|	ВТ_ДанныеТоваровКДоставке.ДатаПоступления
	|ИЗ
	|	ВТ_ДанныеТоваровКДоставке КАК ВТ_ДанныеТоваровКДоставке
	|ГДЕ
	|	НЕ ВТ_ДанныеТоваровКДоставке.Статус В (ЗНАЧЕНИЕ(Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Отменен))
	|	И ВТ_ДанныеТоваровКДоставке.Количество <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеТоваровКДоставке.Регистратор,
	|	ВТ_ДанныеТоваровКДоставке.Период,
	|	ВТ_ДанныеТоваровКДоставке.Организация,
	|	ВТ_ДанныеТоваровКДоставке.ЗаказПоставщику,
	|	ВТ_ДанныеТоваровКДоставке.Номенклатура,
	|	ВТ_ДанныеТоваровКДоставке.Характеристика,
	|	ВТ_ДанныеТоваровКДоставке.Количество,
	|	ВТ_ДанныеТоваровКДоставке.АдресОтправления,
	|	ВТ_ДанныеТоваровКДоставке.АдресДоставки,
	|	ВТ_ДанныеТоваровКДоставке.ОжидаемаяДатаДоставки,
	|	ВТ_ДанныеТоваровКДоставке.ЗаказНаДоставку,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВТ_ДанныеТоваровКДоставке.Исполнитель,
	|	ВТ_ДанныеТоваровКДоставке.ВидДоставки,
	|	ВТ_ДанныеТоваровКДоставке.Партнер,
	|	ВТ_ДанныеТоваровКДоставке.Контрагент,
	|	ВТ_ДанныеТоваровКДоставке.ДатаПоступления
	|ИЗ
	|	ВТ_ДанныеТоваровКДоставке КАК ВТ_ДанныеТоваровКДоставке
	|ГДЕ
	|	ВТ_ДанныеТоваровКДоставке.Статус В (ЗНАЧЕНИЕ(Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Завершен))
	|	И ВТ_ДанныеТоваровКДоставке.Количество <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст запроса для определения реквизитов доставки.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстЗапросаРеквизитыДоставки() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Шапка.Номер             КАК Номер,
	|	Шапка.Проведен          КАК Проведен,
	|	Шапка.Ссылка            КАК Ссылка,
	|	Шапка.Дата              КАК Дата,
	|	Шапка.Партнер           КАК ПолучательОтправитель,
	|	Шапка.Контрагент 		КАК Перевозчик,
	|	ВЫБОР 
	|		КОГДА Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УСОERP_ИсполнителиДоставки.СобственнымиСилами) 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка) 
	|	КОНЕЦ 					КАК СпособДоставки, 
	|
	|	ЗНАЧЕНИЕ(Справочник.ЗоныДоставки.ПустаяССылка)	КАК Зона,
	|	Шапка.АдресДоставки 							КАК Адрес,
	|	Шапка.АдресДоставкиЗначенияПолей				КАК АдресЗначенияПолей,
	|
	|	ДАТАВРЕМЯ(1,1,1)    	КАК ВремяС,
	|	Шапка.СрокДоставки		КАК ВремяПо,
	|	""""					КАК ДополнительнаяИнформация,
	|	ЗаказКДоставке.Склад	КАК Склад,
	|	ИСТИНА                  КАК ДоставитьПолностью,
	|	ЛОЖЬ КАК ОсобыеУсловияПеревозки,
	|	"""" КАК ОсобыеУсловияПеревозкиОписание
	|
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаказКДоставке.Ссылка КАК Ссылка,
	|		ЗаказКДоставке.Ссылка.Склад КАК Склад
	|	ИЗ
	|		Документ.УСОERP_ЗаказНаПеревозку.КДоставке КАК ЗаказКДоставке
	|	ГДЕ
	|		ЗаказКДоставке.Ссылка В (&Ссылки)
	|		И ЗаказКДоставке.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	) КАК ЗаказКДоставке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ЗаказНаПеревозку КАК Шапка
	|		ПО (Шапка.Ссылка = ЗаказКДоставке.Ссылка)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании,НастройкиФормы) Экспорт
	
	
	Документы.ЗаданиеНаПеревозку.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании); 		
	Документы.ПриобретениеУслугПрочихАктивов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);	
	
КонецПроцедуры

#КонецОбласти 

#Область Отчеты
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти   

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросДляРасчетаСостоянийОтгрузки

// Возвращает текст запроса для расчета состояния отгрузки
//
Функция ТекстЗапросаДляРасчетаСостоянийОтгрузки() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаказНаПеревозку.Ссылка КАК Ссылка,
	|	ЗаказНаПеревозку.Проведен КАК Проведен,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеревозку.Статус В (ЗНАЧЕНИЕ(Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Подготовлен),ЗНАЧЕНИЕ(Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Согласован),ЗНАЧЕНИЕ(Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.ВРаботе)) 
	|			ТОГДА ""КОтгрузке""
	|		КОГДА ЗаказНаПеревозку.Статус В (ЗНАЧЕНИЕ(Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Завершен), ЗНАЧЕНИЕ(Перечисление.УСОERP_СтатусыЗаказаНаПеревозку.Отменен))
	|			ТОГДА ""Отгружено""
	|	КОНЕЦ КАК Статус,
	|	Значение(Перечисление.СпособыДоставки.ПустаяСсылка) КАК СпособДоставки,
	|	ЗаказНаПеревозку.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеревозку.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И ЗаказНаПеревозку.Дата >= ЗаказНаПеревозку.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьОрдернуюСхемуПриОтгрузке,
	|	ЗаказНаПеревозку.Склад.НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку КАК НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку,
	|	ЛОЖЬ КАК ЕстьРасхождения
	|ИЗ
	|	Документ.УСОERP_ЗаказНаПеревозку КАК ЗаказНаПеревозку
	|ГДЕ
	|	ЗаказНаПеревозку.Ссылка В(&ДокументыОтгрузки)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
